{
  "title": "Project 1",
  "media": "9rDALI8KUaE?si=-aaKC1-i6azi16BN",
  "subtitles": [
    {
      "title": "Project Description",
      "content": "Library of Meialia is a 2D rogue-like fantasy game created by Minerva Studio, expected to be published by September 2024. In the game, you will play as a dragon named Amlos. Explore the prestigious institution, the Library of Meialia, to fight against injustice, expand the boundaries of knowledge, and venture into uncharted zones. More importantly, you will have friends by your side. In this world of magic and intrigue, you always have someone dear to your heart, whether they are Pomtacines, Thelathines, or even Humans. As long as you thirst for knowledge and are eager to uncover the truth, the Library of Meialia will always be a welcoming place for you. (Warning: It is not a welcoming place)"
    },
    {
      "title": "What I did",
      "content": ""
    },
    {
      "title": "As a Narrative Designer",
      "content": "I came to this studio to face an elongated worldview which was designed by a former Studio member and it was my job to absorb this world and adapt it for this game. As I edited the worldview document, I started planning for the Narrative components of the game, each being Book System, Dialogue System, and Task System. The rest are endless writing and editing… And I have led our group to come up with three major leading principles as follows:\n\n1. Blend the narrative portion into the other aspects of the game: it is a rogue-like game, we want to prioritize the smoothness of the game process and allow players to feel the flow within the game. Thus, the narrative should be natural instead of disruptive.\n\n2. Convey the grand worldview within the library setting: the whole gameplay happens in the library, but it is far more than just the library, we want the player to feel the larger world though they are just going to see the library, and this is done through narrative design.\n\n3. Allow different types of players to enjoy this narrative system: we understand that players came to this game for various reasons, whether it is about the story or not. The narrative system is designed to provide a basic taste of the world for everyone and allow for more exploration if you would like to (please do because we have been working on it for so long and so hard!)."
    }
  ]
}
